In [1]:
%load_ext sql

In [2]:
%sql postgresql://alphalu:******@localhost/interview

'Connected: alphalu@interview'

In [17]:
%%sql
CREATE TABLE Student(
s_id    CHAR(4)      NOT NULL,
s_name  VARCHAR(20)  NOT NULL,
s_birth DATE,
s_sex    VARCHAR(10) NOT NULL,
PRIMARY KEY(s_id));

 * postgresql://alphalu:***@localhost/interview
   postgresql://alphalu:***@localhost/tb
Done.

[]

In [18]:
%%sql
CREATE TABLE Course(
c_id CHAR(4) NOT NULL,
c_name VARCHAR(20) NOT NULL,
t_id CHAR(4) NOT NULL,
PRIMARY KEY(c_id));

 * postgresql://alphalu:***@localhost/interview
   postgresql://alphalu:***@localhost/tb
Done.

[]

In [23]:
%%sql
CREATE TABLE Teacher(
t_id CHAR(4) NOT NULL,
t_name VARCHAR(20),
PRIMARY KEY(t_id));

 * postgresql://alphalu:***@localhost/interview
   postgresql://alphalu:***@localhost/tb
Done.

[]

In [87]:
%%sql
CREATE TABLE Score(
s_id CHAR(4) NOT NULL,
c_id CHAR(4) NOT NULL,
s_score INT NOT NULL,
PRIMARY KEY(s_id,c_id));

 * postgresql://alphalu:***@localhost/interview
Done.

[]

In [27]:
%%sql
insert into Student values('01' , '赵雷' , '1990-01-01' , '男');
insert into Student values('02' , '钱电' , '1990-12-21' , '男');
insert into Student values('03' , '孙风' , '1990-05-20' , '男');
insert into Student values('04' , '李云' , '1990-08-06' , '男');
insert into Student values('05' , '周梅' , '1991-12-01' , '女');
insert into Student values('06' , '吴兰' , '1992-03-01' , '女');
insert into Student values('07' , '郑竹' , '1989-07-01' , '女');
insert into Student values('08' , '王菊' , '1990-01-20' , '女');
insert into Student values('09' , '赵屁' , '1996-02-01' , '男');
insert into Student values('10' , '刘健' , '1992-03-05' , '男');
insert into Student values('11' , '刘凯' , '1994-02-11' , '男');
insert into Student values('12' , '李梅' , '1999-08-05' , '女');
insert into Student values('13' , '王楠' , '1996-09-11' , '女');
insert into Student values('14' , '丁宁' , '1990-05-25' , '女');
insert into Student values('15' , '丁凯' , '2000-12-01' , '男');
insert into Student values('16' , '李楠' , '1998-06-08' , '男');
insert into Student values('17' , '王大锤' , '1996-12-01' , '男');
insert into Student values('18' , '李艳楠' , '2000-11-01' , '女');
insert into Student values('19' , '翁梅玲' , '1997-04-22' , '女');
insert into Student values('20' , '林兵营' , '1996-04-21' , '女');
insert into Student values('21' , '赵屁' , '1999-08-08' , '男');
insert into Student values('22' , '赵屁' , '1994-08-21' , '男');
insert into Student values('23' , '林兵营' , '2002-04-11' , '女');

 * postgresql://alphalu:***@localhost/interview
   postgresql://alphalu:***@localhost/tb
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [28]:
%%sql
insert into Course values('01' , '语文' , '02');
insert into Course values('02' , '数学' , '01');
insert into Course values('03' , '英语' , '03');
insert into Course values('04' , '生物' , '06');
insert into Course values('05' , '化学' , '07');
insert into Course values('06' , '物理' , '04');
insert into Course values('07' , '政治' , '05');

 * postgresql://alphalu:***@localhost/interview
   postgresql://alphalu:***@localhost/tb
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [29]:
%%sql
insert into Teacher values('01' , '张三');
insert into Teacher values('02' , '李四');
insert into Teacher values('03' , '王五');
insert into Teacher values('04' , '苏五');
insert into Teacher values('05' , '赵柳');
insert into Teacher values('06' , '丁琪');
insert into Teacher values('07' , '猴子');

 * postgresql://alphalu:***@localhost/interview
   postgresql://alphalu:***@localhost/tb
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [88]:
%%sql
insert into Score values('01' , '01' , 80);
insert into Score values('01' , '02' , 90);
insert into Score values('01' , '03' , 99);
insert into Score values('01' , '04' , 80);
insert into Score values('01' , '05' , 90);
insert into Score values('01' , '06' , 99);
insert into Score values('01' , '07' , 89);


insert into Score values('02' , '01' , 70);
insert into Score values('02' , '02' , 60);
insert into Score values('02' , '03' , 80);
insert into Score values('02' , '05' , 70);
insert into Score values('02' , '06' , 60);
insert into Score values('02' , '07' , 80);

insert into Score values('03' , '01' , 80);
insert into Score values('03' , '02' , 80);
insert into Score values('03' , '03' , 80);
insert into Score values('03' , '05' , 85);
insert into Score values('03' , '06' , 86);
insert into Score values('03' , '04' , 70);
insert into Score values('03' , '07' , 70);


insert into Score values('04' , '01' , 50);
insert into Score values('04' , '02' , 30);
insert into Score values('04' , '03' , 20);
insert into Score values('04' , '04' , 50);
insert into Score values('04' , '06' , 30);
insert into Score values('04' , '07' , 40);

insert into Score values('05' , '01' , 76);
insert into Score values('05' , '02' , 87);
insert into Score values('05' , '06' , 76);
insert into Score values('05' , '07' , 87);

insert into Score values('06' , '01' , 31);
insert into Score values('06' , '03' , 34);
insert into Score values('06' , '06' , 31);
insert into Score values('06' , '04' , 34);

insert into Score values('07' , '02' , 89);
insert into Score values('07' , '03' , 98);
insert into Score values('07' , '05' , 89);
insert into Score values('07' , '06' , 98);

 * postgresql://alphalu:***@localhost/interview
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [35]:
%%sql
select * from Student

 * postgresql://alphalu:***@localhost/interview
   postgresql://alphalu:***@localhost/tb
23 rows affected.

[('01  ', '赵雷', datetime.date(1990, 1, 1), '男'),
 ('02  ', '钱电', datetime.date(1990, 12, 21), '男'),
 ('03  ', '孙风', datetime.date(1990, 5, 20), '男'),
 ('04  ', '李云', datetime.date(1990, 8, 6), '男'),
 ('05  ', '周梅', datetime.date(1991, 12, 1), '女'),
 ('06  ', '吴兰', datetime.date(1992, 3, 1), '女'),
 ('07  ', '郑竹', datetime.date(1989, 7, 1), '女'),
 ('08  ', '王菊', datetime.date(1990, 1, 20), '女'),
 ('09  ', '赵屁', datetime.date(1996, 2, 1), '男'),
 ('10  ', '刘健', datetime.date(1992, 3, 5), '男'),
 ('11  ', '刘凯', datetime.date(1994, 2, 11), '男'),
 ('12  ', '李梅', datetime.date(1999, 8, 5), '女'),
 ('13  ', '王楠', datetime.date(1996, 9, 11), '女'),
 ('14  ', '丁宁', datetime.date(1990, 5, 25), '女'),
 ('15  ', '丁凯', datetime.date(2000, 12, 1), '男'),
 ('16  ', '李楠', datetime.date(1998, 6, 8), '男'),
 ('17  ', '王大锤', datetime.date(1996, 12, 1), '男'),
 ('18  ', '李艳楠', datetime.date(2000, 11, 1), '女'),
 ('19  ', '翁梅玲', datetime.date(1997, 4, 22), '女'),
 ('20  ', '林兵营', datetime.date(1996, 4, 21), '女'),
 ('21  ', '赵屁', datetime.date(1999, 8, 8), '男'),
 ('22  ', '赵屁', datetime.date(1994, 8, 21), '男'),
 ('23  ', '林兵营', datetime.date(2002, 4, 11), '女')]

In [36]:
%%sql
select * from Course

 * postgresql://alphalu:***@localhost/interview
   postgresql://alphalu:***@localhost/tb
7 rows affected.

[('01  ', '语文', '02  '),
 ('02  ', '数学', '01  '),
 ('03  ', '英语', '03  '),
 ('04  ', '生物', '06  '),
 ('05  ', '化学', '07  '),
 ('06  ', '物理', '04  '),
 ('07  ', '政治', '05  ')]

In [37]:
%%sql
select * from Teacher

 * postgresql://alphalu:***@localhost/interview
   postgresql://alphalu:***@localhost/tb
7 rows affected.

[('01  ', '张三'),
 ('02  ', '李四'),
 ('03  ', '王五'),
 ('04  ', '苏五'),
 ('05  ', '赵柳'),
 ('06  ', '丁琪'),
 ('07  ', '猴子')]

In [38]:
%%sql
select * from Score

 * postgresql://alphalu:***@localhost/interview
   postgresql://alphalu:***@localhost/tb
38 rows affected.

[('01  ', '01  ', 80),
 ('01  ', '02  ', 90),
 ('01  ', '03  ', 99),
 ('01  ', '04  ', 80),
 ('01  ', '05  ', 90),
 ('01  ', '06  ', 99),
 ('01  ', '07  ', 89),
 ('02  ', '01  ', 70),
 ('02  ', '02  ', 60),
 ('02  ', '03  ', 80),
 ('02  ', '05  ', 70),
 ('02  ', '06  ', 60),
 ('02  ', '07  ', 80),
 ('03  ', '01  ', 80),
 ('03  ', '02  ', 80),
 ('03  ', '03  ', 80),
 ('03  ', '05  ', 85),
 ('03  ', '06  ', 86),
 ('03  ', '04  ', 70),
 ('03  ', '07  ', 70),
 ('04  ', '01  ', 50),
 ('04  ', '02  ', 30),
 ('04  ', '03  ', 20),
 ('04  ', '04  ', 50),
 ('04  ', '06  ', 30),
 ('04  ', '07  ', 40),
 ('05  ', '01  ', 76),
 ('05  ', '02  ', 87),
 ('05  ', '06  ', 76),
 ('05  ', '07  ', 87),
 ('06  ', '01  ', 31),
 ('06  ', '03  ', 34),
 ('06  ', '06  ', 31),
 ('06  ', '04  ', 34),
 ('07  ', '02  ', 89),
 ('07  ', '03  ', 98),
 ('07  ', '05  ', 89),
 ('07  ', '06  ', 98)]

1.查询课程编号为“001”的课程比“002”的课程成绩高的所有学生的学号

In [42]:
%%sql
select s.s_id,a.c_id,a.s_score,b.c_id,b.s_score
from Student s inner join 
(select s_id,c_id,s_score from Score where c_id='01')as a 
on a.s_id=s.s_id
inner join 
(select s_id,c_id,s_score from Score where c_id='02')as b
on b.s_id=s.s_id
where a.s_score>b.s_score

 * postgresql://alphalu:***@localhost/interview
   postgresql://alphalu:***@localhost/tb
2 rows affected.

[('02  ', '01  ', 70, '02  ', 60), ('04  ', '01  ', 50, '02  ', 30)]

查询平均成绩大于60分的学生的学号和平均成绩

In [46]:
%%sql
select * from(select s_id,avg(s_score)as avgscore from Score 
group by s_id)as a where avgscore>60

 * postgresql://alphalu:***@localhost/interview
   postgresql://alphalu:***@localhost/tb
5 rows affected.

[('03  ', Decimal('78.7142857142857143')),
 ('01  ', Decimal('89.5714285714285714')),
 ('02  ', Decimal('70.0000000000000000')),
 ('07  ', Decimal('93.5000000000000000')),
 ('05  ', Decimal('81.5000000000000000'))]

查询所有学生的学号、姓名、选课数、总成绩

In [47]:
%%sql
select s.s_id,s_name,count(distinct c_id),sum(s_score)
from Student s,Score a
where s.s_id=a.s_id
group by s.s_id

 * postgresql://alphalu:***@localhost/interview
   postgresql://alphalu:***@localhost/tb
7 rows affected.

[('01  ', '赵雷', 7, 627),
 ('02  ', '钱电', 6, 420),
 ('03  ', '孙风', 7, 551),
 ('04  ', '李云', 6, 220),
 ('05  ', '周梅', 4, 326),
 ('06  ', '吴兰', 4, 130),
 ('07  ', '郑竹', 4, 374)]

查询姓“张”的老师的个数

In [51]:
%%sql
select count(distinct t_name) from Teacher 
where t_name LIKE '张%';

 * postgresql://alphalu:***@localhost/interview
   postgresql://alphalu:***@localhost/tb
1 rows affected.

[(1,)]

查询没学过“张三”老师课的学生的学号、姓名

In [60]:
%%sql
with zhangsancourse as(
select c.c_id from Course c,Teacher t
where t.t_id=c.t_id
and t_name='张三'
)

select distinct s.s_id,s.s_name,c_id from Student s,Score a where a.s_id=s.s_id 
and c_id not in (select * from zhangsancourse)

 * postgresql://alphalu:***@localhost/interview
   postgresql://alphalu:***@localhost/tb
32 rows affected.

[('02  ', '钱电', '01  '),
 ('03  ', '孙风', '03  '),
 ('03  ', '孙风', '04  '),
 ('02  ', '钱电', '03  '),
 ('01  ', '赵雷', '05  '),
 ('03  ', '孙风', '07  '),
 ('04  ', '李云', '06  '),
 ('03  ', '孙风', '05  '),
 ('07  ', '郑竹', '05  '),
 ('05  ', '周梅', '01  '),
 ('01  ', '赵雷', '04  '),
 ('06  ', '吴兰', '06  '),
 ('02  ', '钱电', '07  '),
 ('06  ', '吴兰', '03  '),
 ('05  ', '周梅', '06  '),
 ('07  ', '郑竹', '03  '),
 ('03  ', '孙风', '01  '),
 ('04  ', '李云', '04  '),
 ('05  ', '周梅', '07  '),
 ('06  ', '吴兰', '04  '),
 ('01  ', '赵雷', '07  '),
 ('04  ', '李云', '01  '),
 ('04  ', '李云', '03  '),
 ('01  ', '赵雷', '01  '),
 ('03  ', '孙风', '06  '),
 ('06  ', '吴兰', '01  '),
 ('04  ', '李云', '07  '),
 ('01  ', '赵雷', '06  '),
 ('02  ', '钱电', '05  '),
 ('02  ', '钱电', '06  '),
 ('01  ', '赵雷', '03  '),
 ('07  ', '郑竹', '06  ')]

查询学过“张三”老师所教的所有课的同学的学号、姓名

In [61]:
%%sql
SELECT s_id,s_name FROM student
WHERE s_id IN (SELECT score.s_id FROM score,course,teacher
WHERE score.c_id=course.c_id AND course.t_id=teacher.t_id
AND teacher.t_name='张三' 
GROUP BY s_id
having count(score.c_id)=(select count(c_id) from Course,Teacher
where teacher.t_id=course.t_id and t_name='张三'));

 * postgresql://alphalu:***@localhost/interview
   postgresql://alphalu:***@localhost/tb
6 rows affected.

[('01  ', '赵雷'),
 ('02  ', '钱电'),
 ('03  ', '孙风'),
 ('04  ', '李云'),
 ('05  ', '周梅'),
 ('07  ', '郑竹')]

查询学过编号为“001”的课程并且也学过编号为“002”的课程的学生的学号、姓名

In [3]:
%%sql
select s_id,s_name from Student s where s_id in
(select s_id from Score where c_id='01') and 
s_id in (select s_id from Score where c_id='01')

 * postgresql://alphalu:***@localhost/interview
6 rows affected.

[('01  ', '赵雷'),
 ('02  ', '钱电'),
 ('03  ', '孙风'),
 ('04  ', '李云'),
 ('05  ', '周梅'),
 ('06  ', '吴兰')]

查询课程编号为“002”的总成绩

In [5]:
%%sql
select c_id,sum(s_score) from Score 
where c_id='02'
group by c_id

 * postgresql://alphalu:***@localhost/interview
1 rows affected.

[('02  ', 436)]

**查询所有课程成绩小于60分的学生的学号、姓名**

In [6]:
%%sql
select s_id,s_name from Student 
where s_id in(
select s_id from Score a where
    60>all(select s_score from Score b where a.s_id=b.s_id)
)

 * postgresql://alphalu:***@localhost/interview
2 rows affected.

[('04  ', '李云'), ('06  ', '吴兰')]

查询没有学全所有课的学生的学号、姓名

In [15]:
%%sql
with a as(
    select a.s_id,s_name,count(distinct b.c_id)as num
    from Student a,Score b where a.s_id=b.s_id
group by a.s_id)

select s_id,s_name from a where num<(select count(distinct c_id) from Course)

 * postgresql://alphalu:***@localhost/interview
5 rows affected.

[('02  ', '钱电'),
 ('04  ', '李云'),
 ('05  ', '周梅'),
 ('06  ', '吴兰'),
 ('07  ', '郑竹')]

查询至少有一门课与学号为“05”的学生所学课程相同的学生的学号和姓名

In [18]:
%%sql
with temp as (select c_id from Score 
             where s_id='05')

select distinct s.s_id,s_name from Student s,Score a 
where s.s_id=a.s_id
and a.c_id in( select * from temp)
order by s.s_id

 * postgresql://alphalu:***@localhost/interview
7 rows affected.

[('01  ', '赵雷'),
 ('02  ', '钱电'),
 ('03  ', '孙风'),
 ('04  ', '李云'),
 ('05  ', '周梅'),
 ('06  ', '吴兰'),
 ('07  ', '郑竹')]

查询和“01”号同学所学课程完全相同的其他同学的学号

In [20]:
%%sql
with temp as(
select c_id from Score where s_id='01')

select distinct s_id from Score where
c_id in (select * from temp)
and s_id<>'01'
group by s_id
having count(distinct c_id)=(select count(c_id) from temp)

 * postgresql://alphalu:***@localhost/interview
1 rows affected.

[('03  ',)]

把“SCORE”表中“张三”老师教的课的成绩都更改为此课程的平均成绩(答案未知)

In [28]:
START TRANSACTION;
UPDATE score
SET s_score=(SELECT AVG(b.s_score) FROM score AS b
where b.c_id=score.c_id)
WHERE c_id= 
(SELECT c_id FROM course AS x INNER JOIN teacher AS y
ON x.t_id=y.t_id WHERE t_name='张三');
ROLLBACK;

**查询和“07”号的同学学习的课程完全相同的其他同学学号和姓名**

hint:用除法 A/B A：所有课程学号对， B：所有07同学上的课程号
最内层：返回某个学生学号为s_id 选的全部课程

中间层：返回这个学生没有选修在B中的课程

最外层：查找不存在 这个学生 没有选修B中某门课

Finally 和Stud表连接找名字并去掉学生07 的信息

In [91]:
%%sql
with B as (
select c_id from Score  where s_id='07'),


 temp as(select s.s_id,s.c_id from Score s 
where not exists(
select * from B where not exists(
    select * from Score a 
    where a.s_id=s.s_id and a.c_id=B.c_id
)))

select distinct temp.s_id,s_name from temp,Student where temp.s_id=Student.s_id
and temp.s_id<>'07'
order by temp.s_id

 * postgresql://alphalu:***@localhost/interview
3 rows affected.

[('01  ', '赵雷'), ('02  ', '钱电'), ('03  ', '孙风')]

看一下是否如此，发现01 02 同学上了 2 3 5 6四门课，也就是07 同学上的所有课

In [90]:
%%sql
select * from Score 
order by s_id,c_id

 * postgresql://alphalu:***@localhost/interview
38 rows affected.

[('01  ', '01  ', 80),
 ('01  ', '02  ', 90),
 ('01  ', '03  ', 99),
 ('01  ', '04  ', 80),
 ('01  ', '05  ', 90),
 ('01  ', '06  ', 99),
 ('01  ', '07  ', 89),
 ('02  ', '01  ', 70),
 ('02  ', '02  ', 60),
 ('02  ', '03  ', 80),
 ('02  ', '05  ', 70),
 ('02  ', '06  ', 60),
 ('02  ', '07  ', 80),
 ('03  ', '01  ', 80),
 ('03  ', '02  ', 80),
 ('03  ', '03  ', 80),
 ('03  ', '04  ', 70),
 ('03  ', '05  ', 85),
 ('03  ', '06  ', 86),
 ('03  ', '07  ', 70),
 ('04  ', '01  ', 50),
 ('04  ', '02  ', 30),
 ('04  ', '03  ', 20),
 ('04  ', '04  ', 50),
 ('04  ', '06  ', 30),
 ('04  ', '07  ', 40),
 ('05  ', '01  ', 76),
 ('05  ', '02  ', 87),
 ('05  ', '06  ', 76),
 ('05  ', '07  ', 87),
 ('06  ', '01  ', 31),
 ('06  ', '03  ', 34),
 ('06  ', '04  ', 34),
 ('06  ', '06  ', 31),
 ('07  ', '02  ', 89),
 ('07  ', '03  ', 98),
 ('07  ', '05  ', 89),
 ('07  ', '06  ', 98)]

删除学习“张三”老师课的SC表记录

In [59]:
%%sql
START TRANSACTION;
DELETE FROM score
WHERE c_id IN
(SELECT course.c_id FROM course
JOIN teacher
ON course.t_id=teacher.t_id
WHERE teacher.t_name='张三');
SELECT * FROM score;
ROLLBACK;

 * postgresql://alphalu:***@localhost/interview
Done.
6 rows affected.
32 rows affected.
Done.

[]

**按平均成绩从高到低显示所有学生的 “语文”（c_id='02'）、
“数学”（c_id='01'）、“英语”（c_id='03'）三门课程成绩,按如下形式显示：学生ID，语文，数学，英语，有效课程数，有效平均分**

In [89]:
%%sql
SELECT s_id AS 学生ID,
(SELECT s_score FROM score WHERE score.s_id=x.s_id AND c_id='02') AS 语文,
(SELECT s_score FROM score WHERE score.s_id=x.s_id AND c_id='01') AS 数学,
(SELECT s_score FROM score WHERE score.s_id=x.s_id AND c_id='03') AS 英语,
(SELECT COUNT(c_id) FROM score WHERE score.s_id=x.s_id AND c_id IN 
('01','02','03')) AS 有效课程数,
(SELECT AVG(s_score) FROM score WHERE score.s_id=x.s_id AND c_id IN 
('01','02','03')) AS 有效平均分
FROM score AS x
GROUP BY x.s_id
ORDER BY 有效平均分 DESC;

 * postgresql://alphalu:***@localhost/interview
7 rows affected.

[('07  ', 89, None, 98, 2, Decimal('93.5000000000000000')),
 ('01  ', 90, 80, 99, 3, Decimal('89.6666666666666667')),
 ('05  ', 87, 76, None, 2, Decimal('81.5000000000000000')),
 ('03  ', 80, 80, 80, 3, Decimal('80.0000000000000000')),
 ('02  ', 60, 70, 80, 3, Decimal('70.0000000000000000')),
 ('04  ', 30, 50, 20, 3, Decimal('33.3333333333333333')),
 ('06  ', None, 31, 34, 2, Decimal('32.5000000000000000'))]

查询各科成绩最高和最低的分： 

以如下的形式显示：课程ID，最高分，最低分

In [92]:
%%sql
select c_id as 课程ID,max(s_score)as 最高分,min(s_score)as 最低分
from Score
group by c_id

 * postgresql://alphalu:***@localhost/interview
7 rows affected.

[('06  ', 99, 30),
 ('03  ', 99, 20),
 ('04  ', 80, 34),
 ('01  ', 80, 31),
 ('02  ', 90, 30),
 ('07  ', 89, 40),
 ('05  ', 90, 70)]

按各科平均成绩从低到高和及格率的百分数从高到低排列，
以如下形式显示：课程号课程名平均成绩及格百分数